class Translation(object):
    START_TEXT = """<b>- مرحبـاً بك عـزيـز  
- في بـوت استخـراج اكـواد الايبي ايدي & الايبي هاش
(APP ID - API Hash)
- التابـع الى @a_t_9 - @PICTH0N
━━━━━━━━━━━━━━━━━━━━━━━━
- تستطيع استخراج الاكواد بكل سهـوله
- فقط ارسـل رقم جوال حسابك مع مفتاح الدولة 📲
- مثــال :
+964xxxxxxxxx</b>
"""
    AFTER_RECVD_CODE_TEXT = """<b>- الان قم بارسـال رمـز دخـول الويب
الذي تم ارسـاله اليك من شركـة تيليجـرام</b>

يستخدم هذا الرمـز فقط لغرض الحصول على اكـواد الايبيـات مـن my.telegram.org
"""
    BEFORE_SUCC_LOGIN = "<code>- جـارِ استخـراج الاكـواد الرجـاء الانتظـار لحظـات . . .</code>"
    ERRED_PAGE = """- خطأ في الاستخـراج .. جرب الطريقة اليدوية عبـر الرابـط

كيفية استخراج كود الايبي ايدي والايبي هاش عبر الرابـط :
1. اذهب الى my.telegram.org/auth
2. قم بتسجيل الدخول إلى حساب تيليجرام الخاص بك عبر الرقم
3. اضغط على خيار API Development
4. املأ البيانات على النحو التالي :
• App Title : tgbot
• Short Name : tgbot
• URL : (kosongin)
• Platform : desktop
5. تم الانتهاء من الاستخـراج

إذا قمت باستخراج الاكواد بنجاح ، تستطيع المحاولة مرة أخرى على هذا البوت في اي وقت"""
    CANCELLED_MESG = "<b>- شكـراً لاستخدامك البـوت .. لاعادة الاستخراج مجـدداً ارسـل /start</b>"
    IN_VALID_CODE_PVDED = "<b>- خطـأ .. رمـز الدخـول الذي أدخلتـه غير صحيح ؟!</b>"
    IN_VALID_PHNO_PVDED = "<b>- عـذراً .. رقم الهاتف المحمول الذي أدخلته غير صحيح ، الرجاء إدخال رقم هاتف حساب تيليجـرام مع مفتاح الدولة.\n- مثــال : +964xxxxxxxx</b>"
